Конфигурация/src/Enums/СтатусБронирования/СтатусБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусБронирования</name>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/CommonModules/ОбщиеОбработки/Module.bsl
Процедура АвтоматическоеСнятиеБрони() Экспорт
    // Дата проверки - 3 дня назад от сегодня
    ДатаПорога = ТекущаяДата() - 3;
    
    // Запрос для поиска броней
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |    Бронь.Ссылка
    |ИЗ
    |    Документ.БронированиеНомера КАК Бронь
    |ГДЕ
    |    Бронь.СтатусБронирования = &СтатусОжидания
    |    И Бронь.Дата <= &ДатаПорога
    |";
    
    // Устанавливаем параметры
    Запрос.УстановитьПараметр("СтатусОжидания", Перечисления.СтатусБронирования.ОжидаетОплаты);
    Запрос.УстановитьПараметр("ДатаПорога", ДатаПорога);
    
    // Выполняем
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    // Обрабатываем найденные документы
    Пока Выборка.Следующий() Цикл
        Попытка
            Документ = Выборка.Ссылка.ПолучитьОбъект();
            Документ.СтатусБронирования = Перечисления.СтатусБронирования.Отменено;
            Документ.Записать();
        Исключение
            // Продолжаем работу
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры
// В общем модуле (установите флажки: Сервер, Вызов сервера)
